Revit 2027 API
ParameterAccess.ListParameters(ElementId) Method
 Retrieves all of the parameters, including extended properties, that are applicable to the element specified by the given id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> ListParameters(
	ElementId id
)
Public Function ListParameters (
	id As ElementId
) As IList(Of ElementId)
public:
IList<ElementId^>^ ListParameters(
	ElementId^ id
)
member ListParameters :
        id : ElementId -> IList<ElementId>
Parameters
id ElementId
ElementId of the element whose parameters should be listed.
Return Value
IList<ElementId>
 The ids of parameters applicable to the element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterAccess Class
ListParameters Overload
Autodesk.Revit.DB Namespace